; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	image1 - mode
	spectrograph5 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star4 - direction
	Star3 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph5)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph2)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 Planet14)
	(pointing satellite1 Star4)
	(have_image Planet8 image1)
	(have_image Star9 thermograph2)
	(have_image Star9 spectrograph4)
	(have_image Star10 spectrograph5)
	(have_image Planet11 spectrograph3)
	(have_image Star12 image1)
	(have_image Star12 spectrograph4)
	(have_image Phenomenon13 spectrograph3)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 image1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 12
2. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 1 of 12
3. (turn_to satellite1 star10 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star10)
   goals met: 0 of 12
4. (take_image satellite1 star10 instrument2 spectrograph5)
   added: (have_image star10 spectrograph5)
   goals met: 1 of 12
5. (turn_to satellite1 phenomenon13 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 12
6. (turn_to satellite0 groundstation2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon13 instrument2 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 2 of 12
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
9. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 12
10. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 12
11. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 12
12. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   goals met: 2 of 12
13. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 3 of 12
14. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 3 of 12
15. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 4 of 12
16. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 4 of 12
17. (take_image satellite0 star9 instrument0 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 5 of 12
18. (turn_to satellite0 planet14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet14)
   goals met: 6 of 12
19. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 7 of 12
20. (turn_to satellite1 star4 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star4)
   goals met: 8 of 12
21. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 8 of 12
22. (turn_to satellite1 phenomenon13 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon13)
   goals met: 7 of 12
23. (take_image satellite1 phenomenon13 instrument3 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 8 of 12
24. (turn_to satellite1 planet11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet11)
   goals met: 8 of 12
25. (take_image satellite1 planet11 instrument3 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 9 of 12
26. (turn_to satellite1 star12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star12)
   goals met: 9 of 12
27. (take_image satellite1 star12 instrument3 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 10 of 12
28. (turn_to satellite1 star9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
29. (take_image satellite1 star9 instrument3 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 11 of 12
30. (turn_to satellite1 star4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star4)
   goals met: 12 of 12
